function [R,AzAngle,ElAngle] = xyz2radar(x1,y1,z1,x2,y2,z2)
%========================================================================%
%功能:利用雷达与目标的位置信息计算目标相对于雷达天线的角度                  %
%输入：雷达位置（x1,y1,z1），目标位置（x2,y2,z2）                          %
%输出：目标在雷达天线视场方位角AzAngle，俯仰角ElAngle，距离R               %
%========================================================================%
R = sqrt((x2-x1)^2+(y2-y1)^2+(z2-z1)^2);
AzAngle = atan((y2-y1)/(x2-x1))*180/pi;
ElAngle = asin((z2-z1)/R)*180/pi;
% AzAngle = 2;
% ElAngle = 2;
